#include <iostream>


//основные игровые элементы
// 
// космический корабль
// пули
// инопланетяне
// счетчик очков
// счетик жизней
// здания защиты
// игровая сцена	
// 
// 
// свойства игрока{
//		Местоположение
//		Здоровье
//		размер 
//		скорость
//		скорость стрельбы	
//	}
//
// 	Действия{
//		Стрелять
//		Двигаться
//		получать урон
//}
// 
// Противники{
//		здоровье
//		местоположение
//		размер
//		тип
//		стоимость в очках
//		скорость
//		скорость стрельбы
//		
// }
//
//Действия{
//	Стрелять
//	Двигаться
//	Получать урон
//	Выбрасывание 
// 
// Пули
//		{
//		Свойства{
//		
//			Местоположение
//			скорость
//			Урон 
//				}
//		Действия{
//			двигаться		
//			наносить урон
//			самовыпиливаться
//			сталкиваться
//
//		}
// 
//	}
// СЧЕТЧИК ОЧКОВ{
//	Свойства{
//		Местоположение 
//		количество
//		}
//	Действия{
//		Сообщает количество очков
//		Прибавляет очки
// 
// 
// 
//		}
// }
// 
// Счетчик Жизней
// 
//	Свойства{
//		Местоположение 
//		количество
//		}
//	Действия{
//		Сообщает количество очков
//		Прибавляет очки
// 
// 
// 
//		}
// }
// Здания Защиты{
//	Cвойства{
//		Здоровья
//		Размер
//		Стоимость
//		Расположение
// 
//		}
//	Действия{
//		Получать урон
//		Выбрасывать бонусы 
//  
//		}
//		 
// }
// 
// 
// Игровая Сцена{
//	Свойства{
//		Список противников
//		Список зданий защиты
//		
// 
//		 }
//	Действия{
//		Собираем действия от объектов
//		Обрабатываем события
//		даем команду на отрисовку
//		}// 

// 
// 
// 
// }
// 
//



int main() {
	int a = 5;
	int* ptr = &a;



	return 0;
}